#Задание №1
#Разность множеств

a = [2, 5, 8, 2, 12, 12, 4]
b = [2, 7, 12, 3]
for number in a:
    if number in b:
        a.remove(number)
print(a)

print(my_list_1-my_list_2)

#Задание №2
#Дата, из числа в текст

data = input('Введите день: '), input('Введите месяц: '), input('Введите год: ')
day = {"01": "первое ", "02": "второе ", "03": "третье ", "04": "четвертое ", "05": "пятое ", "06": "шестое ",
       "07": "седьмое ", "08": "восьмое "," 09": "девятое ", "10": "десятое ", "11": "одиннадцатое ",
       "12": "двенадцатое ", "13": "тринадцатое ", "14": "четырнадцатое ", "15": "пятнадцатое ",
       "16": "шестнадцатое ", "17": "семнадцатое ", "18": "восемнадцатое ", "19": "девятнадцатое ",
       "20": "двадцатое ", "21": "двадцать первое ", "22": "двадцать второе ", "23": "двадцать третье ",
       "24": "двадцать четвертое ", "25": "двадцать пятое ", "26":"двадцать шестое ", "27": "двадцать седьмое ",
       "28":  "двадцать восьмое ", "29": "двадцать девятое ", "30": "тридцатое ", "31":"тридцать первое "}
month = {"01": "января ", "02": "февраля ", "03": "марта ", "04": "апреля ", "05": "мая ", "06": "июня ", "07": "июля ",
         "08": "августа ", "09": "сентября ", "10": "октября ", "11": "ноября ", "12": "декабря "}
result = []
stop = 1
if int(data[1]) >= 13 or int(data[0]) >= 32:
    print('невозможное сочитание')
    stop = 0
elif int(data[1]) == 2 and int(data[0]) >= 29:
    print('невозможное сочитание')
    stop = 0
elif int(data[1]) == (4 or 6 or 9 or 11) and int(data[0]) >= 31:
    print('невозможное сочитание')
    stop = 0

elif stop == 0:
    exit()
else:
    d = data[0]
    m = data[1]
    y = data[2]
    result = f'{day[d]} {month[m]} {y} года'
print(result)

#Задание №3
#Уникальные элементы

my_list = [2, 2, 5, 12, 8, 2, 12]
i = 0
new_list = []
while i < len(my_list):
    result = my_list.count(my_list[i])
    if result == 1:
        new_list.append(my_list[i])
    i += 1

print(new_list)